#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=83a8f09c28b7a40427566200394ed7bb67d6b82f]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yODY1NDVlZS1jODllLTRkZDEtYWNmYy04MmNhNTJjN2JkMGM7b2JqZWN0SWQ9NmQ4MDUwYzQtZjI3ZC00MGYzLTg4YjAtOWFkMjU2OTQ4ZTE5O3N1YnNjcmlwdGlvbklkPWU2NzFmMjNiLWE3ODktNDliZi1iYTQzLWRjY2U5ZTA1ZjUxZjt0ZW5hbnRJZD1hYmIwMjJkMy05NDc5LTRmOTYtOTZhMy04MzAzMzQ4Y2NkYzE=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/e671f23b-a789-49bf-ba43-dcce9e05f51f/resourceGroups/si-gh-20240320-dev/providers/Microsoft.Compute/virtualMachines/example-machine-pr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.service will be created
  + resource "azurerm_app_service" "service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "uksouth"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "si-gh-20240320-dev"
      + site_credential                   = (known after apply)
    }

  # azurerm_app_service_plan.plan will be created
  + resource "azurerm_app_service_plan" "plan" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "uksouth"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "my-webapp-sikebe-ms-gh-plan"
      + resource_group_name          = "si-gh-20240320-dev"

      + sku {
          + capacity = (known after apply)
          + size     = "B1"
          + tier     = "Basic"
        }
    }

  # random_string.example will be created
  + resource "random_string" "example" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with azurerm_app_service_plan.plan,
  on virtual_machine.tf line 64, in resource "azurerm_app_service_plan" "plan":
  64: resource "azurerm_app_service_plan" "plan" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @sikebe-ms, Action: `pull_request`*